 TW 1
 pandas series and DataFrame 
 -> Practice Pandas Series and DataFrame with examples."
 Write full names of your team members who worked together
 Submission
 Push the completed code to your Github repository.
 
 by  peddiraju trivikram and shivaram muppidi

In [10]:
import pandas as pd

In [12]:
import pandas as pd
alist = ['Mouse', 'Giraffe', 'Tiger', 'Dog', 'Hippopotamus', 'Moose', 'Bear']
animals = pd.Series(alist)
animals

0           Mouse
1         Giraffe
2           Tiger
3             Dog
4    Hippopotamus
5           Moose
6            Bear
dtype: object

In [13]:
animals[2]

'Tiger'

In [14]:
animals.iloc[2]

'Tiger'

In [15]:
animals.loc[2]

'Tiger'

In [17]:
s1=pd.Series(alist,index=[0,1,2,3,4,5,6])
s1

0           Mouse
1         Giraffe
2           Tiger
3             Dog
4    Hippopotamus
5           Moose
6            Bear
dtype: object

In [18]:
s2=pd.Series(alist,index=['a','b','c','d','e','f','g'])
s2

a           Mouse
b         Giraffe
c           Tiger
d             Dog
e    Hippopotamus
f           Moose
g            Bear
dtype: object

In [19]:
s2['c']

'Tiger'

In [20]:
s2.loc['c']

'Tiger'

In [21]:
s2.iloc[2]

'Tiger'

In [22]:
names=['Chris','Kevin','Bob','Vinod','Daniel','Fil','Stephanie']
owners=pd.Series(names)
owners

0        Chris
1        Kevin
2          Bob
3        Vinod
4       Daniel
5          Fil
6    Stephanie
dtype: object

In [23]:
frame={'animals':animals,'owners':owners}
df=pd.DataFrame(frame)
df

        animals     owners
0         Mouse      Chris
1       Giraffe      Kevin
2         Tiger        Bob
3           Dog      Vinod
4  Hippopotamus     Daniel
5         Moose        Fil
6          Bear  Stephanie

In [24]:
df.columns

Index(['animals', 'owners'], dtype='object')

In [25]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [26]:
type(df['animals'])

pandas.core.series.Series

In [27]:
df.iloc[0]

animals    Mouse
owners     Chris
Name: 0, dtype: object

In [28]:
df.iloc[0][1]

'Chris'

In [31]:
copy_df = df.copy()
copy_df

        animals     owners
0         Mouse      Chris
1       Giraffe      Kevin
2         Tiger        Bob
3           Dog      Vinod
4  Hippopotamus     Daniel
5         Moose        Fil
6          Bear  Stephanie

In [32]:
df3= df.drop(columns=['owners'])
df3

        animals
0         Mouse
1       Giraffe
2         Tiger
3           Dog
4  Hippopotamus
5         Moose
6          Bear

In [33]:
df4 = df.drop([0,1])
df4

        animals     owners
2         Tiger        Bob
3           Dog      Vinod
4  Hippopotamus     Daniel
5         Moose        Fil
6          Bear  Stephanie

In [34]:
midx=pd.MultiIndex(levels=[['lama','cow','falcon'],['speed','weight']],codes=[[0,0,1,1,2,2],[0,1,0,1,0,1]])
midx

MultiIndex([(  'lama',  'speed'),
            (  'lama', 'weight'),
            (   'cow',  'speed'),
            (   'cow', 'weight'),
            ('falcon',  'speed'),
            ('falcon', 'weight')],
           )

In [38]:
df = pd.DataFrame(index=midx, columns=['big','small'],
                data=[[45,30],[200,100],[30,20],[250,150],[320,250],[1,0.8]])
df

               big  small
lama   speed    45   30.0
       weight  200  100.0
cow    speed    30   20.0
       weight  250  150.0
falcon speed   320  250.0
       weight    1    0.8

In [39]:
df.drop(index='cow', columns='small')

               big
lama   speed    45
       weight  200
falcon speed   320
       weight    1

In [41]:
df.drop(index='weight',level=1)

              big  small
lama   speed   45   30.0
cow    speed   30   20.0
falcon speed  320  250.0

In [42]:
dept_s= ['CS','Bio','Chem','Phy','Eng']
dept_s_series = pd.Series(dept_s, index=[0,1,2,3,4])

In [43]:
floor_s = [5,3,3,2,4]
floor_s_series= pd.Series(floor_s, index=[0,1,2,3,4])

In [44]:
schedule = {'dept': dept_s_series,'floor': floor_s_series}

In [45]:
df_1 = pd.DataFrame(schedule)
df_1

   dept  floor
0    CS      5
1   Bio      3
2  Chem      3
3   Phy      2
4   Eng      4

In [46]:
#Access the first row:
row_1 = df_1.iloc[0]
row_1

dept     CS
floor     5
Name: 0, dtype: object

In [47]:
#Access the first column data (indexed by 'dept') and print it.
col_1 = df_1['dept']
col_1

0      CS
1     Bio
2    Chem
3     Phy
4     Eng
Name: dept, dtype: object

In [48]:
#Create a new DataFrame by dropping the 2nd column data (indexed by 'floor') from the current DataFrame.
df_2 = df_1.drop(['floor'],axis=1)
print(df_2)

   dept
0    CS
1   Bio
2  Chem
3   Phy
4   Eng